var Products =[
	{name:"ប្រហុកខ្ទិះ",pic:"kh1.jpg",disscriptions:"ប្រហុកខ្ទិះ៖ ជាម្ហូបប្រពៃណីមួយបែបទៀត ដែលមានអាយុកាលចំណាស់ និងពេញនិយមក្នុងខេត្តសៀមរាប ដោយគេបរិភោគវា ជាមួយនឹងបន្លែស្រស់ៗ។ គ្រឿងផ្សំដែលយកមកប្រើក្នុងម្ហូបមួយមុខនេះ រួមមាន ប្រហុកសាច់ចិញ្រ្ចាំ, សាច់ជ្រូកបីជាន់ចិញ្ច្រាំ, គ្រឿងបុក, ត្រប់ពុតលំញង,ខ្ទិះដូង, ម្ទេសឆ្អើរចិញ្រ្ចាំ និងគ្រឿងទេសផ្សេងៗទៀត៕"},
	{name:"ទឹកគ្រឿង",pic:"kh2.jpg",disscriptions:"ទឹកគ្រឿង៖ ជាម្ហូបពេញនិយមមួយមុខទៀត ដែលពលរដ្ឋខ្មែរ ក៏ដូចបរទេស ចូលចិត្តទទួលទាន។ ទឹកគ្រឿងត្រូវបានផ្សំឡើងដោយ សាច់ត្រី ប្រហុក និងគ្រឿងទេស។ ម្ហូបសាមញ្ញមួយមុខនេះ មិនបរិភោគតែឯងនោះទេ គឺគេបរិភោគជាមួយបន្លែច្រើនមុខ មិនក្រោម១០មុខឡើយ រួមមាន ស្តៅ ផ្កាស្នោរ ផ្កាកំប្លោក ត្រកួន តាសក់ ប្រពាយ ត្រប់ រួមនឹងបន្លែជាច្រើនមុខផ្សេងទៀត។ "},
	{name:"សម្លស្រឡក់",pic:"kh3.jpg",disscriptions:"សម្លស្រឡក់៖ ម្ហូបមួយមុខនេះ មានរសជាតិប្រហាក់ប្រហែលសម្លប្រហើរ គ្រាន់តែ ប្រហើរមានហ័នស្លឹកគ្រៃ រួចយកទៅបុកឱ្យហ្មត់ជាមួយខ្ទឹម រមៀត ទើបគេដាក់ចូលសម្លពេលដាក់ចុះពីចង្ក្រាន។ ចំណែកឯ សម្លស្រឡក់គេដាក់ស្លឹកគ្រៃទាំងវែងមិនហ័នទេ គ្រាន់តែញីឱ្យមានក្លិន ហើយដាក់ចូលនៅពេលទឹកសម្លនៅលើចង្ក្រាន ហើយនៅពេលម្ហូបនោះឆ្អិន គេនឹងស្រង់ស្លឹកគ្រៃនោះចេញ។ សម្លស្រឡក់ គេប្រើបន្លែដូចជា ននោង ផ្សិត ត្រឡាច ល្ពៅ ស្លឹកបាស ត្រាវ ឬដំឡូងជាដើម។ "},
	{name:"អាម៉ុក",pic:"kh4.jpg",disscriptions:"អាម៉ុក៖ ជាម្ហូបតំណាងប្រទេសកម្ពុជា។ ម្ហូបមួយមុខនេះ ជាការផ្សំបញ្ចូលគ្នារវាងគ្រឿងការី សាច់ត្រី ខ្ទិះដូង ប្រហុក  ស្លឹកញ គ្រឿងទេសផ្សេងៗ ព្រមទាំងអប់ដោយស្លឹកចេក។ ពាក់ព័ន្ធនឹងមុខម្ហូបមួយមុខនេះនាសន្និសីទអន្តរជាតិលើកទី១ ឆ្នាំ២០១៩ ស្ដីពីទេសចរណ៍ម្ហូបអាហារកម្ពុជា រាជរដ្ឋាភិបាលកម្ពុជាគ្រោងនឹងស្នើសុំដាក់សម្លហហ្មុក រួមជាមួយម្ហូបអាហារ៤មុខទៀត ចូលទៅក្នុងបញ្ជីបេតិកភណ្ឌពិភពលោកអរូបិយរបស់អង្គការយូណេស្កូ (UNESCO)ផងដែរ។"},
]

var result="";
Products.map((e)=>{
			result+=`
				<div class="col-xl-3 col-md-6 col-sm-12 mt-2">
							<div class="card ">
									<img class='card-img-top' src="img/${e.pic}" alt="">
									<div class="card-body">
											<h3 class="name">${e.name}</h3>
											<p class="discription">${e.disscriptions}</p>
									</div>
							</div>
					</div>
			`;
			document.querySelector('.row').innerHTML=result;
})